server/app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
---
    def index
        articles = Article.all
        render json: articles.map { |article| ArticleSerializer.new(article).serializable_hash[:data][:attributes] }, status: :ok

INSERT INTO "articles" ("title", "body", "likes", "dislikes", "status", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
    def create
        current_user = User.find_by(session[:user_id])
        if current_user
            article = Article.new(article_params)
            if article.save

UPDATE "articles" SET "updated_at" = $1 WHERE "articles"."id" = $2  [["updated_at", "2023-04-26 00:38:10.776444"], ["id", 1]]
---
    def update
        article = find_article
        current_user = User.find_by(session[:user_id])
        if current_user && (current_user == article.user || current_user.role == "admin")
            if article.update(article_params)