server/app/controllers/profiles_controller.rb

    def index
      @profiles = Profile.all
      render json: @profiles.map { |profile| ProfileSerializer.new(profile).serializable_hash[:data][:attributes] }, status: :ok
---
SELECT "profiles".* FROM "profiles"