server/app/controllers/subscriptions_controller.rb

    def create
        current_user = User.find_by(session[:user_id])
          if current_user
            params[:category_ids].map do |cat_id|
            subscription = Subscription.create(user: current_user, category_id: cat_id.to_i)
---
INSERT INTO "subscriptions" ("category_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["category_id", 8], ["user_id", 1], ["created_at", "2023-04-24 09:29:47.063372"], ["updated_at", "2023-04-24 09:29:47.063372"]]