server/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "password_digest", "role", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["username", "zakiMM"], ["email", "akzaki17@gmail.com"], ["password_digest", "[FILTERED]"], ["role", 0], ["created_at", "2023-04-25 19:25:50.671077"], ["updated_at", "2023-04-25 19:25:50.671077"]]
---
    def create
        user = User.create(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
---
    def find_user
        User.find(params[:id])